КАКерамика_моя_старая_база/src/InformationRegisters/КонтурЛогистика_БазовыеСоответствияНоменклатуры/КонтурЛогистика_БазовыеСоответствияНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КонтурЛогистика_БазовыеСоответствияНоменклатуры</name>
  <resources>
    <name>Учитывать</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КоэффициентПересчетаМест</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоэффициентПересчетаМестОбратный</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КоэффициентПересчетаКоличествоПаллет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КодТНВЭД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОтгрузочноеНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СостояниеГруза</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>МассаБруттоКг</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>17</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОбъемКубМ</name>
    <comment>Необязательное поле</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>17</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>МассаНеттоКг</name>
    <comment>необязательная, обязательная - Брутто</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>17</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>МассаОбъемМеста</name>
    <comment>если истина - будем считать введенный объем и массы места, а не штуки</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДопИнформация</name>
    <comment>необязательное поле</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОбъявленнаяЦенность</name>
    <comment>Стоимость (ценность) груза с налогом - всего</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОбъявленнаяЦенностьВалюта</name>
    <comment>Стоимость (ценность) груза с налогом - всего</comment>
    <type>
      <types>DefinedType.КонтурЛогистика_Валюты</types>
    </type>
  </resources>
  <resources>
    <name>СпособУпаковки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВидТары</name>
    <type>
      <types>CatalogRef.КонтурЛогистика_КлассификаторУпаковок</types>
    </type>
  </resources>
  <resources>
    <name>Плотность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>УчетГрузаВГИС</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЗначениеМаркировки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОписаниеОпасногоГруза</name>
    <type>
      <types>CatalogRef.КонтурЛогистика_ОписанияОпасныхГрузов</types>
    </type>
  </resources>
  <resources>
    <name>Высота</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>17</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Длина</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>17</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Ширина</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>17</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Насыпной</name>
    <comment>Насыпной</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СтранаПроисхождения</name>
    <comment>Страна происхождения продукции</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_СтраныМира</types>
    </type>
  </resources>
  <resources>
    <name>Крупногабаритный</name>
    <comment>только у крупногабаритных грузов в документе ТРН будут указываться габариты</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>DefinedType.КонтурЛогистика_Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УпаковкаЕдиницаИзмерения</name>
    <type>
      <types>DefinedType.КонтурЛогистика_УпаковкиЕдиницыИзмерения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>DefinedType.КонтурЛогистика_ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_ВидыМеханизмов/КонтурЛогистика_ВидыМеханизмов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЛогистика_ВидыМеханизмов</name>
  <enumValues>
    <name>СоответствияНоменклатуры</name>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база/src/InformationRegisters/КонтурЛогистика_БазовыеСоответствияНоменклатуры/Forms/ФормаЗаписи/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("УпаковкаЕдиницаИзмерения") И ЗначениеЗаполнено(Параметры.УпаковкаЕдиницаИзмерения) Тогда 
		Запись.УпаковкаЕдиницаИзмерения = Параметры.УпаковкаЕдиницаИзмерения;
	КонецЕсли;
	
	Если Параметры.Свойство("Характеристика") И  ЗначениеЗаполнено(Параметры.Характеристика) Тогда 
		Запись.Характеристика = Параметры.Характеристика;
	КонецЕсли;
	
	Если Параметры.Свойство("Номенклатура") И ЗначениеЗаполнено(Параметры.Номенклатура) Тогда
		
		Запись.Номенклатура = Параметры.Номенклатура;
		
		Запись.ОтгрузочноеНаименование =  Запись.Номенклатура.Наименование;
		Запись.СостояниеГруза	=  "Без замечаний";
		Запись.СпособУпаковки 	=  "В таре";
		Запись.ВидТары 			=  Справочники.КонтурЛогистика_КлассификаторУпаковок.НайтиПоКоду("CT");

		КонтурЛогистика_КонвертацияТиповые.ЗаполнитьВесогабаритныеПараметрыБазовогоСоответствия(Запись);
	
	КонецЕсли;
	
	// у заказа (заявки) еще доп. поля обязательны
	Если КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ИспользуетсяЗаказЗаявка") Тогда 
		
		Элементы.Высота.АвтоОтметкаНезаполненного = Истина;
		Элементы.Ширина.АвтоОтметкаНезаполненного = Истина;
		Элементы.Длина.АвтоОтметкаНезаполненного = Истина;
		Элементы.ОбъемКубМ.АвтоОтметкаНезаполненного = Истина;
		
	КонецЕсли;
	
	УстановитьТипы();
	
	ОбновитьОтображениеПоГруппамДоступа();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьТипы()
	
	КонтурЛогистика_ОбщегоНазначенияСервер.УстановитьОграниченияТипа("Номенклатура" , Элементы.Номенклатура);
	КонтурЛогистика_ОбщегоНазначенияСервер.УстановитьОграничениеТипаЕдиницИзмерения(Элементы.УпаковкаЕдиницаИзмерения);
	
	КонтурЛогистика_ОбщегоНазначенияСервер.УстановитьВидимостьХарактеристик(Элементы.Характеристика);
	
	Если Элементы.Характеристика.Видимость Тогда
		КонтурЛогистика_ОбщегоНазначенияСервер.УстановитьОграниченияТипа("Характеристика" , Элементы.Характеристика);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Декорация1Нажатие(Элемент)
	КонтурЛогистика_ОбщегоНазначенияКлиент.Предупреждение_КонтурЛогистика("Товары с одинаковым описанием будут свернуты в 1 строку (если другие реквизиты это позволят)");
КонецПроцедуры

&НаКлиенте
Процедура ЕдиницаИзмеренияНачалоВыбораЗавершение(ВыбранноеЗначение, ДопПараметр = Неопределено) Экспорт
	
	Если ВыбранноеЗначение = Неопределено ИЛИ НЕ ЗначениеЗаполнено(ВыбранноеЗначение.Значение)  Тогда
		Запись.УпаковкаЕдиницаИзмерения = КонтурЛогистика_ОбщегоНазначенияСервер.ПолучитьБазовуюЕдиницуИзмерения(Запись.Номенклатура);
    иначе
        Запись.УпаковкаЕдиницаИзмерения = ВыбранноеЗначение.Значение;
    КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура УпаковкаЕдиницаИзмеренияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	КонтурЛогистика_ОбщегоНазначенияКлиент.ЕдиницаИзмеренияНачалоВыбора(Запись.Номенклатура, Элемент, ЭтаФорма, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ХарактеристикаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	КонтурЛогистика_ОбщегоНазначенияКлиент.ХарактеристикаНачалоВыбора(Запись.Номенклатура, Запись.Характеристика, Элемент, ЭтаФорма, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ХарактеристикаНачалоВыбораЗавершение(ВыбранноеЗначение, ДопПараметр = Неопределено) Экспорт
	
	Если ВыбранноеЗначение <> Неопределено И ЗначениеЗаполнено(ВыбранноеЗначение.Значение)  Тогда
		
		Если ТипЗнч(ВыбранноеЗначение.Значение) = Тип("Структура") Тогда
			Запись.Характеристика = ВыбранноеЗначение.Значение.Значение;
		Иначе 
			Запись.Характеристика = ВыбранноеЗначение.Значение;
		КонецЕсли;
		
    КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура НасыпнойПриИзменении(Элемент)
	
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура УправлениеЭлементамиФормы()
	
	Элементы.ГруппаКоэффициентПересчетаМест.Доступность = Не Запись.Насыпной;
	ОбновитьВизуализациюКоэффициентовМест();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьОтображениеПоГруппамДоступа()
	
	ТекущийПользователь = ПараметрыСеанса.ТекущийПользователь;
	
	ДоступыПользователя = КонтурЛогистика_ОбщегоНазначенияСервер.ДоступыПользователя(ТекущийПользователь);
	
	Если ДоступыПользователя.ПолныйДоступ Тогда
		Возврат;
	КонецЕсли;
	
	// Механизмы
	ДоступКМеханизмам = ДоступыПользователя.ДоступКМеханизмам;
	
	МеханизмСоответствия = Перечисления.КонтурЛогистика_ВидыМеханизмов.СоответствияНоменклатуры;
	ТолькоПросмотрЭлементов = ДоступКМеханизмам.ТолькоПросмотр.Получить(МеханизмСоответствия);
	СозданиеРедактированиеЭлементов = ДоступКМеханизмам.СозданиеРедактирование.Получить(МеханизмСоответствия);
	
	Если Не ТолькоПросмотрЭлементов И Не СозданиеРедактированиеЭлементов Тогда
		ВызватьИсключение "У вас нет доступа. Обратитесь к администратору.";
	КонецЕсли;
	
	ЭтаФорма.ТолькоПросмотр = ТолькоПросмотрЭлементов;
	
КонецПроцедуры

&НаКлиенте
Процедура КоВсемСоответствиям(Команда)
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы(
		"РегистрСведений.КонтурЛогистика_БазовыеСоответствияНоменклатуры.Форма.ФормаНабораЗаписей",
		Новый Структура("Номенклатура", Запись.Номенклатура));
		
КонецПроцедуры

&НаКлиенте
Процедура ПлотностьПриИзменении(Элемент)
	
	Запись.Плотность = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ОкруглитьПлотность(Запись.Плотность);
	
КонецПроцедуры

&НаКлиенте
Процедура КоэффициентПересчетаМестИПаллетОбратныйПриИзменении(Элемент)
	
	ОбновитьВизуализациюКоэффициентовМест();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВизуализациюКоэффициентовМест()

	Кобратный = Запись.КоэффициентПересчетаМестОбратный;
	Элементы.МестСлева.Видимость = Кобратный;
	Элементы.УпаковкаСлева.Видимость = Не Кобратный;
	Элементы.МестСправа.Видимость = Не Кобратный;
	Элементы.УпаковкаСправа.Видимость = Кобратный;

	МассаИОбъемУказаныУМеста = Запись.МассаОбъемМеста;
	
	Если МассаИОбъемУказаныУМеста Тогда 
		Элементы.МассаНеттоКг.Заголовок = "Масса нетто 1 места (кг)";
		Элементы.ОбъемКубМ.Заголовок = "Объем (куб м.) 1 места";
	Иначе
		Элементы.МассаНеттоКг.Заголовок = "Масса нетто 1 единицы (кг)";
		Элементы.ОбъемКубМ.Заголовок = "Объем (куб м.) 1 единицы";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура МассаОбъемМестаПриИзменении(Элемент)
	ОбновитьВизуализациюКоэффициентовМест();
КонецПроцедуры

&НаКлиенте
Процедура ВысотаПриИзменении(Элемент)
	ОбновитьОбъемМеста();
КонецПроцедуры

&НаКлиенте
Процедура ДлинаПриИзменении(Элемент)
	ОбновитьОбъемМеста();
КонецПроцедуры

&НаКлиенте
Процедура ШиринаПриИзменении(Элемент)
	ОбновитьОбъемМеста();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОбъемМеста()
	
	Запись.ОбъемКубМ = Запись.Высота * Запись.Длина * Запись.Ширина;
	
КонецПроцедуры
